In [129]:
import pandas as pd

In [130]:
df = pd.read_csv("./data_file/student_marks.csv")
df

     Name  Maths  Science  English
0    Amit     78       65       89
1  Bhavin     90       88       76
2   Charu     55       45       67
3   Divya     92       95       98
4    Ekta     40       55       34

In [131]:
#@# Calculate Total & Percentage
df["Total"] = df[["Maths","Science","English"]].sum(axis=1);
df

     Name  Maths  Science  English  Total
0    Amit     78       65       89    232
1  Bhavin     90       88       76    254
2   Charu     55       45       67    167
3   Divya     92       95       98    285
4    Ekta     40       55       34    129

In [132]:
df["Percentage"]  = df["Total"] / 3
df

     Name  Maths  Science  English  Total  Percentage
0    Amit     78       65       89    232   77.333333
1  Bhavin     90       88       76    254   84.666667
2   Charu     55       45       67    167   55.666667
3   Divya     92       95       98    285   95.000000
4    Ekta     40       55       34    129   43.000000

In [133]:
### Define Pass/Fail (pass if all subjects >= 35) 

# ge means greater than or equal to (>=).
# Returns a boolean DataFrame (True/False values).
print("check to mark is grater then 35 :\n")
print(df[["Maths","Science","English"]].ge(35),"\n")

# all(axis=1) checks if all values in a row are True.
# axis=1 means check row-wise (student-wise).
# If one subject is below 35 â†’ result becomes False.
print("check to mark is grater then 35 depend on row's :\n")
print(df[["Maths","Science","English"]].ge(35).all(axis=1),"\n")

# Converts True/False into "Pass" or "Fail"
# map() replaces each boolean with a string according to the dictionary
print("check to mark is grater then 35 depend on row's and pass and fail depend on mark's :\n")
print(df[["Maths","Science","English"]].ge(35).all(axis=1).map({True:"PASS",False:"FAIL"}))

check to mark is grater then 35 :

   Maths  Science  English
0   True     True     True
1   True     True     True
2   True     True     True
3   True     True     True
4   True     True    False

check to mark is grater then 35 depend on row's :

0     True
1     True
2     True
3     True
4    False
dtype: bool

check to mark is grater then 35 depend on row's and pass and fail depend on mark's :

0    PASS
1    PASS
2    PASS
3    PASS
4    FAIL
dtype: object

In [134]:
df["Result"] = df[["Maths","Science","English"]].ge(35).all(axis=1).map({True:"PASS",False:"FAIL"})
df

     Name  Maths  Science  English  Total  Percentage Result
0    Amit     78       65       89    232   77.333333   PASS
1  Bhavin     90       88       76    254   84.666667   PASS
2   Charu     55       45       67    167   55.666667   PASS
3   Divya     92       95       98    285   95.000000   PASS
4    Ekta     40       55       34    129   43.000000   FAIL

In [135]:
### Find Topper (by Total marks)
# topper = df["Percentage"].idxmax()
topper = df.loc[df["Total"].idxmax(),["Name","Total","Percentage"]]
topper

Name          Divya
Total           285
Percentage     95.0
Name: 3, dtype: object

In [136]:
### Average marks in each subject
subject_avg = df[["Maths","Science","English"]].mean()
subject_avg

Maths      71.0
Science    69.6
English    72.8
dtype: float64

In [137]:
### Subject-wise topper (Pivot Table)
# pd.melt() is used to unpivot a DataFrame â€” it converts wide format into long format.
# Wide format â†’ subjects are separate columns.
# Long format â†’ all subjects come under one column, and marks go into another.

subject_toppers = df.melt(id_vars="Name", value_vars=["Maths", "Science", "English"],var_name="Subject", value_name="Marks")
# drop_duplicates() funciton is is drop duplicates record's
pivot = subject_toppers.sort_values(["Subject","Marks"], ascending=[True,False]).drop_duplicates("Subject") 
pivot

     Name  Subject  Marks
13  Divya  English     98
3   Divya    Maths     92
8   Divya  Science     95

In [138]:
print("--- student result ---")
df

--- student result ---

     Name  Maths  Science  English  Total  Percentage Result
0    Amit     78       65       89    232   77.333333   PASS
1  Bhavin     90       88       76    254   84.666667   PASS
2   Charu     55       45       67    167   55.666667   PASS
3   Divya     92       95       98    285   95.000000   PASS
4    Ekta     40       55       34    129   43.000000   FAIL

In [139]:
print("\n--- Topper ---")
print(f"Name: {topper['Name']}, Total: {topper['Total']}")

--- Topper ---
Name: Divya, Total: 285

In [140]:
print("\n--- Subject Averages ---")
print(subject_avg)

--- Subject Averages ---
Maths      71.0
Science    69.6
English    72.8
dtype: float64

In [141]:
print("\n--- Subject-wise Toppers ---")
print(pivot[["Subject","Name","Marks"]])

--- Subject-wise Toppers ---
    Subject   Name  Marks
13  English  Divya     98
3     Maths  Divya     92
8   Science  Divya     95